# Parameter Type Id Rebar Shape Name Property

Source: https://www.revitapidocs.com/2026/b2105a96-11eb-ffed-0213-4ad1d58a0c13.htm

---

| Parameter Type Id Rebar Shape Name Property |
| --- |

"Shape Name"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RebarShapeName { get; }
```

```
Public Shared ReadOnly Property RebarShapeName As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RebarShapeName {
	ForgeTypeId^ get ();
}
```

```
static member RebarShapeName : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace